import sys
import requests

map_req = "http://static-maps.yandex.ru/1.x/"

p_1 ='37.633959,55.828516'  # Павильон 1
p_2 = '37.632717,55.828590'  # дорога
p_3 = '37.632074,55.828973'  # поворот
p_4 = '37.631369,55.828974'  # поворот
p_5 = '37.631506,55.828468'  # Павильон 2
p_6 = '37.633438,55.829585'  # поворот напротив
p_7 = '37.633468,55.829924'  # поворот
p_8 = '37.634079,55.829986'  # Дворец Госуслуг
p_9 = '37.635328,55.829893'  # Выставка актуального
p_10 = '37.633576,55.830283'  # поворот
p_11 = '37.633139,55.830528'  # поворот
p_12 = '37.633696,55.830867'  # Павильон 68
p_13 = '37.632722,55.830747'  # поворот
p_14 = '37.632635,55.831016'  # Павильон 67
p_15 = '37.632113,55.830737'  # поворот
p_16 = '37.631243,55.831226'  # поворот
p_17 = '37.632050,55.831690'  # Павильон 66



coordinats = [p_1, p_2, p_3, p_4, p_5, p_4, p_3, p_6, p_7, p_8, p_9, p_8, p_7, p_10, p_11, p_12, p_11, p_13, p_14, p_13, p_15, p_16, p_17]
points = ['37.633959,55.828516,pm2ntm1', '37.631369,55.828974,pm2dbm2',
          '37.634079,55.829986,pm2blm3', '37.635328,55.829893,pm2wtm4',
          '37.633696,55.830867,pm2ywm5', '37.632635,55.831016,pm2orm6',
          '37.632050,55.831690,pm2rdm7']

params = {
    "ll": '37.635426,55.829703',
    "spn": '0.003,0.003',
    "l": 'map',
    "pl": ','.join(coordinats),
    "pt": '~'.join(points)
}

response = requests.get(map_req, params=params)


if not response:
    print("Ошибка выполнения запроса:")
    print("Http статус:", response.status_code, "(", response.reason, ")")
    sys.exit(1)

map_file = "map1.png"
with open(map_file, "wb") as file:
    file.write(response.content)